Merge remote-tracking branch 'upstream/dev' into davidzollo_pr10988-pgvector-rescue
